package com.epam.elearn.aggregationAndСomposition.third;

/*
3. Создать объект класса Государство, используя классы Область, Район, Город.
Методы: вывести на консоль столицу, количество областей, площадь, областные центры.
 */

public class Main {



    public static void main(String[] args) {
        System.out.println("Capital");
    }

}
